"""Завдання 1. 
Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". 
Використовуючи PuLP, створити модель, яка визначає, скільки "Лимонаду" та "Фруктового соку" 
потрібно виробити для максимізації загальної кількості продуктів, дотримуючись обмежень на ресурси. 
1. "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
2. "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
3. Обмеження ресурсів: 
- 100 од. "Води"
- 50 од. "Цукру"
- 30 од. "Лимонного соку"
- 40 од. "Фруктового пюре"
4. Виробництво одиниці "Лимонаду" = 2 од. "Води" + 1 од. "Цукру" + 1 од. "Лимонного соку".
5. Виробництво одиниці "Фруктового соку" = 2 од. "Фруктового пюре" + 1 од. "Води".
"""
import pulp

model = pulp.LpProblem("Максимізація_Виробництва", pulp.LpMaximize)

L = pulp.LpVariable("Лимонад", lowBound=0, cat="Continuous")  # Змінна для лимонаду
F = pulp.LpVariable("ФруктовийСік", lowBound=0, cat="Continuous")  # Змінна для фруктового соку

# Цільова функція
model += L + F, "Обсяг_ Виробництва"

# Обмеження
model += 2 * L + F <= 100, "Вода"  # Обмеження на воду
model += 1 * L <= 50, "Цукор"  # Обмеження на цукор
model += 1 * L <= 30, "ЛимоннийСік"  # Обмеження на лимонний сік
model += 2 * F <= 40, "ФруктовеПюре"  # Обмеження на фруктове пюре


model.solve()

print(f"Статус: {pulp.LpStatus[model.status]}")
print(f"Лимонад: {pulp.value(L)}")
print(f"Фруктовий Сік: {pulp.value(F)}")
print(f"Обсяг Виробництва: {pulp.value(model.objective)}")